mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2h4xg/common/s6e2h4xg.h
#define bFM_ADC2_SCIS23_AN16                      *((volatile  uint8_t *)(0x424E4200UL))
#define bFM4_ADC2_SCIS23_AN16                     *((volatile  uint8_t *)(0x424E4200UL))
#define bFM_ADC2_SCIS23_AN17                      *((volatile  uint8_t *)(0x424E4204UL))
#define bFM4_ADC2_SCIS23_AN17                     *((volatile  uint8_t *)(0x424E4204UL))
#define bFM_ADC2_SCIS23_AN18                      *((volatile  uint8_t *)(0x424E4208UL))
#define bFM4_ADC2_SCIS23_AN18                     *((volatile  uint8_t *)(0x424E4208UL))
#define bFM_ADC2_SCIS23_AN19                      *((volatile  uint8_t *)(0x424E420CUL))
#define bFM4_ADC2_SCIS23_AN19                     *((volatile  uint8_t *)(0x424E420CUL))
#define bFM_ADC2_SCIS23_AN20                      *((volatile  uint8_t *)(0x424E4210UL))
#define bFM4_ADC2_SCIS23_AN20                     *((volatile  uint8_t *)(0x424E4210UL))
#define bFM_ADC2_SCIS23_AN21                      *((volatile  uint8_t *)(0x424E4214UL))
#define bFM4_ADC2_SCIS23_AN21                     *((volatile  uint8_t *)(0x424E4214UL))
#define bFM_ADC2_SCIS23_AN22                      *((volatile  uint8_t *)(0x424E4218UL))
#define bFM4_ADC2_SCIS23_AN22                     *((volatile  uint8_t *)(0x424E4218UL))
#define bFM_ADC2_SCIS23_AN23                      *((volatile  uint8_t *)(0x424E421CUL))
#define bFM4_ADC2_SCIS23_AN23                     *((volatile  uint8_t *)(0x424E421CUL))
#define bFM_ADC2_SCIS23_AN24                      *((volatile  uint8_t *)(0x424E4220UL))
#define bFM4_ADC2_SCIS23_AN24                     *((volatile  uint8_t *)(0x424E4220UL))
#define bFM_ADC2_SCIS23_AN25                      *((volatile  uint8_t *)(0x424E4224UL))
#define bFM4_ADC2_SCIS23_AN25                     *((volatile  uint8_t *)(0x424E4224UL))
#define bFM_ADC2_SCIS23_AN26                      *((volatile  uint8_t *)(0x424E4228UL))
#define bFM4_ADC2_SCIS23_AN26                     *((volatile  uint8_t *)(0x424E4228UL))
#define bFM_ADC2_SCIS23_AN27                      *((volatile  uint8_t *)(0x424E422CUL))
#define bFM4_ADC2_SCIS23_AN27                     *((volatile  uint8_t *)(0x424E422CUL))
#define bFM_ADC2_SCIS23_AN28                      *((volatile  uint8_t *)(0x424E4230UL))
#define bFM4_ADC2_SCIS23_AN28                     *((volatile  uint8_t *)(0x424E4230UL))
#define bFM_ADC2_SCIS23_AN29                      *((volatile  uint8_t *)(0x424E4234UL))
#define bFM4_ADC2_SCIS23_AN29                     *((volatile  uint8_t *)(0x424E4234UL))
#define bFM_ADC2_SCIS23_AN30                      *((volatile  uint8_t *)(0x424E4238UL))
#define bFM4_ADC2_SCIS23_AN30                     *((volatile  uint8_t *)(0x424E4238UL))
#define bFM_ADC2_SCIS23_AN31                      *((volatile  uint8_t *)(0x424E423CUL))
#define bFM4_ADC2_SCIS23_AN31                     *((volatile  uint8_t *)(0x424E423CUL))

#define bFM_ADC2_WCMPCR_RCOE                      *((volatile  uint8_t *)(0x424E4988UL))
#define bFM4_ADC2_WCMPCR_RCOE                     *((volatile  uint8_t *)(0x424E4988UL))
#define bFM_ADC2_WCMPCR_RCOIE                     *((volatile  uint8_t *)(0x424E498CUL))
#define bFM4_ADC2_WCMPCR_RCOIE                    *((volatile  uint8_t *)(0x424E498CUL))
#define bFM_ADC2_WCMPCR_RCOIRS                    *((volatile  uint8_t *)(0x424E4990UL))
#define bFM4_ADC2_WCMPCR_RCOIRS                   *((volatile  uint8_t *)(0x424E4990UL))

#define bFM_ADC2_WCMPSR_WCMD                      *((volatile  uint8_t *)(0x424E49B4UL))
#define bFM4_ADC2_WCMPSR_WCMD                     *((volatile  uint8_t *)(0x424E49B4UL))

#define bFM_ADC2_WCMRCIF_RCINT                    *((volatile  uint8_t *)(0x424E4900UL))
#define bFM4_ADC2_WCMRCIF_RCINT                   *((volatile  uint8_t *)(0x424E4900UL))

#define bFM_ADC2_WCMRCOT_RCOOF                    *((volatile  uint8_t *)(0x424E4880UL))
#define bFM4_ADC2_WCMRCOT_RCOOF                   *((volatile  uint8_t *)(0x424E4880UL))


/*******************************************************************************
* BT Registers BT0
*   Bitband Section
*******************************************************************************/
#define bFM_BT0_PPG_STC_UDIR                      *((volatile  uint8_t *)(0x424A0200UL))
#define bFM4_BT0_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424A0200UL))
#define bFM_BT0_PPG_STC_TGIR                      *((volatile  uint8_t *)(0x424A0208UL))
#define bFM4_BT0_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424A0208UL))
#define bFM_BT0_PPG_STC_UDIE                      *((volatile  uint8_t *)(0x424A0210UL))
#define bFM4_BT0_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424A0210UL))
#define bFM_BT0_PPG_STC_TGIE                      *((volatile  uint8_t *)(0x424A0218UL))
#define bFM4_BT0_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424A0218UL))

#define bFM_BT0_PPG_TMCR_STRG                     *((volatile  uint8_t *)(0x424A0180UL))
#define bFM4_BT0_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424A0180UL))
#define bFM_BT0_PPG_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A0184UL))
#define bFM4_BT0_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A0184UL))
#define bFM_BT0_PPG_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A0188UL))
#define bFM4_BT0_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A0188UL))
#define bFM_BT0_PPG_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A018CUL))
#define bFM4_BT0_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A018CUL))
#define bFM_BT0_PPG_TMCR_PMSK                     *((volatile  uint8_t *)(0x424A01A8UL))
#define bFM4_BT0_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A01A8UL))
#define bFM_BT0_PPG_TMCR_RTGEN                    *((volatile  uint8_t *)(0x424A01ACUL))
#define bFM4_BT0_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A01ACUL))

#define bFM_BT0_PPG_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A0220UL))
#define bFM4_BT0_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A0220UL))

#define bFM_BT0_PWC_STC_OVIR                      *((volatile  uint8_t *)(0x424A0200UL))
#define bFM4_BT0_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424A0200UL))
#define bFM_BT0_PWC_STC_EDIR                      *((volatile  uint8_t *)(0x424A0208UL))
#define bFM4_BT0_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424A0208UL))
#define bFM_BT0_PWC_STC_OVIE                      *((volatile  uint8_t *)(0x424A0210UL))
#define bFM4_BT0_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424A0210UL))
#define bFM_BT0_PWC_STC_EDIE                      *((volatile  uint8_t *)(0x424A0218UL))
#define bFM4_BT0_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424A0218UL))
#define bFM_BT0_PWC_STC_ERR                       *((volatile  uint8_t *)(0x424A021CUL))
#define bFM4_BT0_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424A021CUL))

#define bFM_BT0_PWC_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A0184UL))
#define bFM4_BT0_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A0184UL))
#define bFM_BT0_PWC_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A0188UL))
#define bFM4_BT0_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A0188UL))
#define bFM_BT0_PWC_TMCR_T32                      *((volatile  uint8_t *)(0x424A019CUL))
#define bFM4_BT0_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424A019CUL))

#define bFM_BT0_PWC_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A0220UL))
#define bFM4_BT0_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A0220UL))

