mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2h4xg/common/s6e2h4xg.h
#define bFM_CAN0_IF1ARB_DIR                       *((volatile  uint8_t *)(0x42C40374UL))
#define bFM4_CAN0_IF1ARB_DIR                      *((volatile  uint8_t *)(0x42C40374UL))
#define bFM_CAN0_IF1ARB_XTD                       *((volatile  uint8_t *)(0x42C40378UL))
#define bFM4_CAN0_IF1ARB_XTD                      *((volatile  uint8_t *)(0x42C40378UL))
#define bFM_CAN0_IF1ARB_MSGVAL                    *((volatile  uint8_t *)(0x42C4037CUL))
#define bFM4_CAN0_IF1ARB_MSGVAL                   *((volatile  uint8_t *)(0x42C4037CUL))

#define bFM_CAN0_IF1CMSK_DATAB                    *((volatile  uint8_t *)(0x42C40240UL))
#define bFM4_CAN0_IF1CMSK_DATAB                   *((volatile  uint8_t *)(0x42C40240UL))
#define bFM_CAN0_IF1CMSK_DATAA                    *((volatile  uint8_t *)(0x42C40244UL))
#define bFM4_CAN0_IF1CMSK_DATAA                   *((volatile  uint8_t *)(0x42C40244UL))
#define bFM_CAN0_IF1CMSK_NEWDAT                   *((volatile  uint8_t *)(0x42C40248UL))
#define bFM4_CAN0_IF1CMSK_NEWDAT                  *((volatile  uint8_t *)(0x42C40248UL))
#define bFM_CAN0_IF1CMSK_CIP                      *((volatile  uint8_t *)(0x42C4024CUL))
#define bFM4_CAN0_IF1CMSK_CIP                     *((volatile  uint8_t *)(0x42C4024CUL))
#define bFM_CAN0_IF1CMSK_CONTROL                  *((volatile  uint8_t *)(0x42C40250UL))
#define bFM4_CAN0_IF1CMSK_CONTROL                 *((volatile  uint8_t *)(0x42C40250UL))
#define bFM_CAN0_IF1CMSK_ARB                      *((volatile  uint8_t *)(0x42C40254UL))
#define bFM4_CAN0_IF1CMSK_ARB                     *((volatile  uint8_t *)(0x42C40254UL))
#define bFM_CAN0_IF1CMSK_MASK                     *((volatile  uint8_t *)(0x42C40258UL))
#define bFM4_CAN0_IF1CMSK_MASK                    *((volatile  uint8_t *)(0x42C40258UL))
#define bFM_CAN0_IF1CMSK_WR_RD                    *((volatile  uint8_t *)(0x42C4025CUL))
#define bFM4_CAN0_IF1CMSK_WR_RD                   *((volatile  uint8_t *)(0x42C4025CUL))

#define bFM_CAN0_IF1CREQ_BUSY                     *((volatile  uint8_t *)(0x42C4023CUL))
#define bFM4_CAN0_IF1CREQ_BUSY                    *((volatile  uint8_t *)(0x42C4023CUL))

#define bFM_CAN0_IF1MCTR_EOB                      *((volatile  uint8_t *)(0x42C4039CUL))
#define bFM4_CAN0_IF1MCTR_EOB                     *((volatile  uint8_t *)(0x42C4039CUL))
#define bFM_CAN0_IF1MCTR_TXRQST                   *((volatile  uint8_t *)(0x42C403A0UL))
#define bFM4_CAN0_IF1MCTR_TXRQST                  *((volatile  uint8_t *)(0x42C403A0UL))
#define bFM_CAN0_IF1MCTR_RMTEN                    *((volatile  uint8_t *)(0x42C403A4UL))
#define bFM4_CAN0_IF1MCTR_RMTEN                   *((volatile  uint8_t *)(0x42C403A4UL))
#define bFM_CAN0_IF1MCTR_RXIE                     *((volatile  uint8_t *)(0x42C403A8UL))
#define bFM4_CAN0_IF1MCTR_RXIE                    *((volatile  uint8_t *)(0x42C403A8UL))
#define bFM_CAN0_IF1MCTR_TXIE                     *((volatile  uint8_t *)(0x42C403ACUL))
#define bFM4_CAN0_IF1MCTR_TXIE                    *((volatile  uint8_t *)(0x42C403ACUL))
#define bFM_CAN0_IF1MCTR_UMASK                    *((volatile  uint8_t *)(0x42C403B0UL))
#define bFM4_CAN0_IF1MCTR_UMASK                   *((volatile  uint8_t *)(0x42C403B0UL))
#define bFM_CAN0_IF1MCTR_INTPND                   *((volatile  uint8_t *)(0x42C403B4UL))
#define bFM4_CAN0_IF1MCTR_INTPND                  *((volatile  uint8_t *)(0x42C403B4UL))
#define bFM_CAN0_IF1MCTR_MSGLST                   *((volatile  uint8_t *)(0x42C403B8UL))
#define bFM4_CAN0_IF1MCTR_MSGLST                  *((volatile  uint8_t *)(0x42C403B8UL))
#define bFM_CAN0_IF1MCTR_NEWDAT                   *((volatile  uint8_t *)(0x42C403BCUL))
#define bFM4_CAN0_IF1MCTR_NEWDAT                  *((volatile  uint8_t *)(0x42C403BCUL))

#define bFM_CAN0_IF1MSK_MDIR                      *((volatile  uint8_t *)(0x42C402F8UL))
#define bFM4_CAN0_IF1MSK_MDIR                     *((volatile  uint8_t *)(0x42C402F8UL))
#define bFM_CAN0_IF1MSK_MXTD                      *((volatile  uint8_t *)(0x42C402FCUL))
#define bFM4_CAN0_IF1MSK_MXTD                     *((volatile  uint8_t *)(0x42C402FCUL))

#define bFM_CAN0_IF2ARB_DIR                       *((volatile  uint8_t *)(0x42C40974UL))
#define bFM4_CAN0_IF2ARB_DIR                      *((volatile  uint8_t *)(0x42C40974UL))
#define bFM_CAN0_IF2ARB_XTD                       *((volatile  uint8_t *)(0x42C40978UL))
#define bFM4_CAN0_IF2ARB_XTD                      *((volatile  uint8_t *)(0x42C40978UL))
#define bFM_CAN0_IF2ARB_MSGVAL                    *((volatile  uint8_t *)(0x42C4097CUL))
#define bFM4_CAN0_IF2ARB_MSGVAL                   *((volatile  uint8_t *)(0x42C4097CUL))

#define bFM_CAN0_IF2CMSK_DATAB                    *((volatile  uint8_t *)(0x42C40840UL))
#define bFM4_CAN0_IF2CMSK_DATAB                   *((volatile  uint8_t *)(0x42C40840UL))
#define bFM_CAN0_IF2CMSK_DATAA                    *((volatile  uint8_t *)(0x42C40844UL))
#define bFM4_CAN0_IF2CMSK_DATAA                   *((volatile  uint8_t *)(0x42C40844UL))
#define bFM_CAN0_IF2CMSK_NEWDAT                   *((volatile  uint8_t *)(0x42C40848UL))
#define bFM4_CAN0_IF2CMSK_NEWDAT                  *((volatile  uint8_t *)(0x42C40848UL))
#define bFM_CAN0_IF2CMSK_CIP                      *((volatile  uint8_t *)(0x42C4084CUL))
#define bFM4_CAN0_IF2CMSK_CIP                     *((volatile  uint8_t *)(0x42C4084CUL))
#define bFM_CAN0_IF2CMSK_CONTROL                  *((volatile  uint8_t *)(0x42C40850UL))
#define bFM4_CAN0_IF2CMSK_CONTROL                 *((volatile  uint8_t *)(0x42C40850UL))
#define bFM_CAN0_IF2CMSK_ARB                      *((volatile  uint8_t *)(0x42C40854UL))
#define bFM4_CAN0_IF2CMSK_ARB                     *((volatile  uint8_t *)(0x42C40854UL))
#define bFM_CAN0_IF2CMSK_MASK                     *((volatile  uint8_t *)(0x42C40858UL))
#define bFM4_CAN0_IF2CMSK_MASK                    *((volatile  uint8_t *)(0x42C40858UL))
#define bFM_CAN0_IF2CMSK_WR_RD                    *((volatile  uint8_t *)(0x42C4085CUL))
#define bFM4_CAN0_IF2CMSK_WR_RD                   *((volatile  uint8_t *)(0x42C4085CUL))

#define bFM_CAN0_IF2CREQ_BUSY                     *((volatile  uint8_t *)(0x42C4083CUL))
#define bFM4_CAN0_IF2CREQ_BUSY                    *((volatile  uint8_t *)(0x42C4083CUL))

